Show / Hide Table of Contents
Class CombiInput
Basic class combination
Inheritance
System.Object
OpenObject
OpenElementId
CombiInput
CombiInputEC
CombiInputSIA
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class CombiInput : OpenElementId
Constructors
Improve this Doc   View Source
CombiInput()
Constructor
Declaration
public CombiInput()
Properties
Improve this Doc   View Source
Description
Additional info
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Items
Combi Items in combination
Declaration
public List<CombiItem> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CombiItem>
Improve this Doc   View Source
Name
Name of combination
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source